11/data/attachments/551e728effe64883.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_2e7bc26c-d79b-455f-a037-0dcd83ca7eaf</nif:username>
            <nif:friendToBeAdded>Peter_success_Actions_91910_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>